In [2]:
a=1
b=2

a

1

In [3]:
pip install numpy

Defaulting to user installation because normal site-packages is not writeable
Collecting numpy
  Downloading numpy-1.23.0-cp310-cp310-win_amd64.whl (14.6 MB)
     ---------------------------------------- 14.6/14.6 MB 7.4 MB/s eta 0:00:00
Installing collected packages: numpy
Successfully installed numpy-1.23.0
Note: you may need to restart the kernel to use updated packages.

  WARNING: The script f2py.exe is installed in 'C:\Users\heysunn\AppData\Roaming\Python\Python310\Scripts' which is not on PATH.
  Consider adding this directory to PATH or, if you prefer to suppress this warning, use --no-warn-script-location.
WARNING: You are using pip version 22.0.4; however, version 22.1.2 is available.
You should consider upgrading via the 'c:\Program Files\Python310\python.exe -m pip install --upgrade pip' command.

In [2]:
import numpy as np

In [5]:
date=[6,5,7,3,4,2]

In [6]:
pip install pandas

Defaulting to user installation because normal site-packages is not writeable
Collecting pandas
  Downloading pandas-1.4.3-cp310-cp310-win_amd64.whl (10.5 MB)
     ---------------------------------------- 10.5/10.5 MB 8.3 MB/s eta 0:00:00
Requirement already satisfied: numpy>=1.21.0 in c:\users\heysunn\appdata\roaming\python\python310\site-packages (from pandas) (1.23.0)
Requirement already satisfied: python-dateutil>=2.8.1 in c:\users\heysunn\appdata\roaming\python\python310\site-packages (from pandas) (2.8.2)
Collecting pytz>=2020.1
  Downloading pytz-2022.1-py2.py3-none-any.whl (503 kB)
     -------------------------------------- 503.5/503.5 KB 7.8 MB/s eta 0:00:00
Requirement already satisfied: six>=1.5 in c:\users\heysunn\appdata\roaming\python\python310\site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)
Installing collected packages: pytz, pandas
Successfully installed pandas-1.4.3 pytz-2022.1
Note: you may need to restart the kernel to use updated packages.

WARNING: You are using pip version 22.0.4; however, version 22.1.2 is available.
You should consider upgrading via the 'c:\Program Files\Python310\python.exe -m pip install --upgrade pip' command.

In [2]:
import pandas as pd
df=pd.read_csv('./data/gapminder.tsv',sep='\t')

In [10]:
import os
os.getcwd()

'c:\\alpa\\최진영강사님'

In [4]:
df=pd.read_csv('./data/gapminder.tsv',sep='\t')

In [18]:
df.head(10)

       country continent  year  lifeExp       pop   gdpPercap
0  Afghanistan      Asia  1952   28.801   8425333  779.445314
1  Afghanistan      Asia  1957   30.332   9240934  820.853030
2  Afghanistan      Asia  1962   31.997  10267083  853.100710
3  Afghanistan      Asia  1967   34.020  11537966  836.197138
4  Afghanistan      Asia  1972   36.088  13079460  739.981106
5  Afghanistan      Asia  1977   38.438  14880372  786.113360
6  Afghanistan      Asia  1982   39.854  12881816  978.011439
7  Afghanistan      Asia  1987   40.822  13867957  852.395945
8  Afghanistan      Asia  1992   41.674  16317921  649.341395
9  Afghanistan      Asia  1997   41.763  22227415  635.341351

In [19]:
df.tail()

       country continent  year  lifeExp       pop   gdpPercap
1699  Zimbabwe    Africa  1987   62.351   9216418  706.157306
1700  Zimbabwe    Africa  1992   60.377  10704340  693.420786
1701  Zimbabwe    Africa  1997   46.809  11404948  792.449960
1702  Zimbabwe    Africa  2002   39.989  11926563  672.038623
1703  Zimbabwe    Africa  2007   43.487  12311143  469.709298

In [20]:
df.shape  #로우갯수 칼럼갯수 알수있음

(1704, 6)

In [6]:
df.index

RangeIndex(start=0, stop=1704, step=1)

In [21]:
df.columns

Index(['country', 'continent', 'year', 'lifeExp', 'pop', 'gdpPercap'], dtype='object')

In [23]:
df.dtypes   #타입만따짐

country       object
continent     object
year           int64
lifeExp      float64
pop            int64
gdpPercap    float64
dtype: object

In [24]:
df.info()  #디타입스보다 좀더 자세한정보, 타입이랑 null이 있는지없는지 빈값확인할떄 좋음

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1704 entries, 0 to 1703
Data columns (total 6 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   country    1704 non-null   object
 1   continent  1704 non-null   object
 2   year       1704 non-null   int64
 3   lifeExp    1704 non-null   float64
 4   pop        1704 non-null   int64
 5   gdpPercap  1704 non-null   float64
dtypes: float64(2), int64(2), object(2)
memory usage: 80.0+ KB

In [27]:
country_df=df['country']   # 컬럼 불러올때
type(country_df)    #시리즈 자료형

pandas.core.series.Series

In [29]:
country_df   #시리즈 : 각 칼럼들을 구성하는 요소    컨트리, 컨티넨트, 이어, 등등 다 시리즈다

0       Afghanistan
1       Afghanistan
2       Afghanistan
3       Afghanistan
4       Afghanistan
           ...
1699       Zimbabwe
1700       Zimbabwe
1701       Zimbabwe
1702       Zimbabwe
1703       Zimbabwe
Name: country, Length: 1704, dtype: object

In [30]:
country_df.tail()

1699    Zimbabwe
1700    Zimbabwe
1701    Zimbabwe
1702    Zimbabwe
1703    Zimbabwe
Name: country, dtype: object

In [3]:
df['country','continent','lifeExp'] #하면 에러남

KeyError: ('country', 'continent', 'lifeExp')

In [34]:
df[['country','continent','lifeExp']]  #원하는거만 가져오고 싶으면 대괄호로 묶어서 가져와야함 
                                        #데이터프레임 (시리즈 여러개 가져오는거)

          country continent  lifeExp
0     Afghanistan      Asia   28.801
1     Afghanistan      Asia   30.332
2     Afghanistan      Asia   31.997
3     Afghanistan      Asia   34.020
4     Afghanistan      Asia   36.088
...           ...       ...      ...
1699     Zimbabwe    Africa   62.351
1700     Zimbabwe    Africa   60.377
1701     Zimbabwe    Africa   46.809
1702     Zimbabwe    Africa   39.989
1703     Zimbabwe    Africa   43.487

[1704 rows x 3 columns]

In [4]:

type(df[['country','continent','lifeExp']])

pandas.core.frame.DataFrame

In [6]:
df.shape

(1704, 6)

In [35]:
df['country']  #하나만 가져온ㄴ건 가능

0       Afghanistan
1       Afghanistan
2       Afghanistan
3       Afghanistan
4       Afghanistan
           ...
1699       Zimbabwe
1700       Zimbabwe
1701       Zimbabwe
1702       Zimbabwe
1703       Zimbabwe
Name: country, Length: 1704, dtype: object

In [37]:
    ### 데이터 추출하기
##loc
# 인덱스와 칼럼을 활용해서 데이터 추출

In [38]:
import pandas as pd
df=pd.read_csv('./data/gapminder.tsv',sep='\t')

In [42]:
df.head(1)

       country continent  year  lifeExp      pop   gdpPercap
0  Afghanistan      Asia  1952   28.801  8425333  779.445314

In [41]:
df.loc[0]  #0번째 로우 선택됨

country      Afghanistan
continent           Asia
year                1952
lifeExp           28.801
pop              8425333
gdpPercap     779.445314
Name: 0, dtype: object

In [44]:
df.loc[1704]  #이런 인덱스가 존재하지 않으므로 에러가남

KeyError: 1704

In [46]:
df.loc[-1]  #해당 인덱스가 없어서    여기 df는  0~ 1703 까지 있음

KeyError: -1

In [11]:
df.shape[-3]

IndexError: tuple index out of range

In [13]:
df.shape[0]-2

1702

In [16]:
last_row_index=df.shape[0]-1
df.loc[last_row_index]  #df.loc[1703]   인덱스 번호는 1703까지가 끝임 0~1703 갯수는 1704개

country        Zimbabwe
continent        Africa
year               2007
lifeExp          43.487
pop            12311143
gdpPercap    469.709298
Name: 1703, dtype: object

In [50]:
df.loc[[0,99,199]]  #데이터프게임으로 뽑아서 나타냄

          country continent  year  lifeExp       pop   gdpPercap
0     Afghanistan      Asia  1952   28.801   8425333  779.445314
99     Bangladesh      Asia  1967   43.453  62821884  721.186086
199  Burkina Faso    Africa  1987   49.557   7586551  912.063142

In [52]:
df.loc[[0,99,199],['pop','year']]

          pop  year
0     8425333  1952
99   62821884  1967
199   7586551  1987

In [51]:
type(df.loc[0])

pandas.core.series.Series

In [53]:
type(df.tail(1))

pandas.core.frame.DataFrame

In [54]:
df.head(10)

       country continent  year  lifeExp       pop   gdpPercap
0  Afghanistan      Asia  1952   28.801   8425333  779.445314
1  Afghanistan      Asia  1957   30.332   9240934  820.853030
2  Afghanistan      Asia  1962   31.997  10267083  853.100710
3  Afghanistan      Asia  1967   34.020  11537966  836.197138
4  Afghanistan      Asia  1972   36.088  13079460  739.981106
5  Afghanistan      Asia  1977   38.438  14880372  786.113360
6  Afghanistan      Asia  1982   39.854  12881816  978.011439
7  Afghanistan      Asia  1987   40.822  13867957  852.395945
8  Afghanistan      Asia  1992   41.674  16317921  649.341395
9  Afghanistan      Asia  1997   41.763  22227415  635.341351

In [55]:
df.loc[1:11]  #이건 마지막도 포함됨 인덱스명으로 명시해서 그런듯

        country continent  year  lifeExp       pop   gdpPercap
1   Afghanistan      Asia  1957   30.332   9240934  820.853030
2   Afghanistan      Asia  1962   31.997  10267083  853.100710
3   Afghanistan      Asia  1967   34.020  11537966  836.197138
4   Afghanistan      Asia  1972   36.088  13079460  739.981106
5   Afghanistan      Asia  1977   38.438  14880372  786.113360
6   Afghanistan      Asia  1982   39.854  12881816  978.011439
7   Afghanistan      Asia  1987   40.822  13867957  852.395945
8   Afghanistan      Asia  1992   41.674  16317921  649.341395
9   Afghanistan      Asia  1997   41.763  22227415  635.341351
10  Afghanistan      Asia  2002   42.129  25268405  726.734055
11  Afghanistan      Asia  2007   43.828  31889923  974.580338

In [56]:
df.head()

       country continent  year  lifeExp       pop   gdpPercap
0  Afghanistan      Asia  1952   28.801   8425333  779.445314
1  Afghanistan      Asia  1957   30.332   9240934  820.853030
2  Afghanistan      Asia  1962   31.997  10267083  853.100710
3  Afghanistan      Asia  1967   34.020  11537966  836.197138
4  Afghanistan      Asia  1972   36.088  13079460  739.981106

In [57]:
df.iloc[1]     #첫번째인 데이터를 가져옴

country      Afghanistan
continent           Asia
year                1957
lifeExp           30.332
pop              9240934
gdpPercap      820.85303
Name: 1, dtype: object

In [58]:
df.loc[1]   #인덱스가 1인거고

country      Afghanistan
continent           Asia
year                1957
lifeExp           30.332
pop              9240934
gdpPercap      820.85303
Name: 1, dtype: object

In [60]:
df.iloc[-1]   #-1번째불러오기 가능 loc는 안되지만

country        Zimbabwe
continent        Africa
year               2007
lifeExp          43.487
pop            12311143
gdpPercap    469.709298
Name: 1703, dtype: object

In [61]:
df.iloc[[0,10,100]]

         country continent  year  lifeExp       pop   gdpPercap
0    Afghanistan      Asia  1952   28.801   8425333  779.445314
10   Afghanistan      Asia  2002   42.129  25268405  726.734055
100   Bangladesh      Asia  1972   45.252  70759295  630.233627

In [62]:
df.iloc[100:200,2:4]   #100번째부터 200번째까지 2,3 칼럼
                        # 마지막 200번이 빠짐

     year  lifeExp
100  1972   45.252
101  1977   46.923
102  1982   50.009
103  1987   52.819
104  1992   56.018
..    ...      ...
195  1967   40.697
196  1972   43.591
197  1977   46.137
198  1982   48.122
199  1987   49.557

[100 rows x 2 columns]

In [63]:
df.loc[:,['year','pop']]

      year       pop
0     1952   8425333
1     1957   9240934
2     1962  10267083
3     1967  11537966
4     1972  13079460
...    ...       ...
1699  1987   9216418
1700  1992  10704340
1701  1997  11404948
1702  2002  11926563
1703  2007  12311143

[1704 rows x 2 columns]

In [64]:
df.iloc[:,[2,4,-1]]

      year       pop   gdpPercap
0     1952   8425333  779.445314
1     1957   9240934  820.853030
2     1962  10267083  853.100710
3     1967  11537966  836.197138
4     1972  13079460  739.981106
...    ...       ...         ...
1699  1987   9216418  706.157306
1700  1992  10704340  693.420786
1701  1997  11404948  792.449960
1702  2002  11926563  672.038623
1703  2007  12311143  469.709298

[1704 rows x 3 columns]

In [65]:
df.iloc[:,['year','pop']]    #칼럼과 인덱스를 넣어봤자 안된다 숫자로 해야함

IndexError: .iloc requires numeric indexers, got ['year' 'pop']

In [68]:
### 실습
df.head(1)

       country continent  year  lifeExp      pop   gdpPercap
0  Afghanistan      Asia  1952   28.801  8425333  779.445314

In [67]:
df.iloc[[0,99,999],[0,3,5]]

         country  lifeExp    gdpPercap
0    Afghanistan   28.801   779.445314
99    Bangladesh   43.453   721.186086
999     Mongolia   51.253  1226.041130

In [69]:
df.loc[[0,99,999],['country','lifeExp','gdpPercap']]

         country  lifeExp    gdpPercap
0    Afghanistan   28.801   779.445314
99    Bangladesh   43.453   721.186086
999     Mongolia   51.253  1226.041130

In [70]:
df.loc[10:13,['country','lifeExp','gdpPercap']]

        country  lifeExp    gdpPercap
10  Afghanistan   42.129   726.734055
11  Afghanistan   43.828   974.580338
12      Albania   55.230  1601.056136
13      Albania   59.280  1942.284244

In [72]:
df.iloc[10:13,[0,3,5]]

        country  lifeExp    gdpPercap
10  Afghanistan   42.129   726.734055
11  Afghanistan   43.828   974.580338
12      Albania   55.230  1601.056136

In [77]:
df.head(1)

       country continent  year  lifeExp      pop   gdpPercap
0  Afghanistan      Asia  1952   28.801  8425333  779.445314

In [5]:
df.groupby('continent')

In [76]:
### groupby : 내가 묶고자 하는 칼럼명을 적어주면됨
# 묶어준 다음 통계적 함수도 적어줘야함 mean max 등등
df.groupby('continent').mean()        #데이터 프레임

             year    lifeExp           pop     gdpPercap
continent
Africa     1979.5  48.865330  9.916003e+06   2193.754578
Americas   1979.5  64.658737  2.450479e+07   7136.110356
Asia       1979.5  60.064903  7.703872e+07   7902.150428
Europe     1979.5  71.903686  1.716976e+07  14469.475533
Oceania    1979.5  74.326208  8.874672e+06  18621.609223

In [78]:
# 만약 위에서 하나의 칼럼만 나오게 하고싶으면 
df.groupby('continent').mean()['lifeExp']   #얘는 시리즈

continent
Africa      48.865330
Americas    64.658737
Asia        60.064903
Europe      71.903686
Oceania     74.326208
Name: lifeExp, dtype: float64

In [79]:
df.groupby('continent').mean()[['lifeExp']]      #얘는 데이터프레임

             lifeExp
continent
Africa     48.865330
Americas   64.658737
Asia       60.064903
Europe     71.903686
Oceania    74.326208

In [80]:
df.groupby('continent')['lifeExp'].mean()   #위랑 차이는 단지 어떤걸 먼저 했느냐의 차이
                                            #대륙으로 묶고 거기서 라이프를 뽑아내고 거기서 평균을 냄

continent
Africa      48.865330
Americas    64.658737
Asia        60.064903
Europe      71.903686
Oceania     74.326208
Name: lifeExp, dtype: float64

In [81]:
df.head()

       country continent  year  lifeExp       pop   gdpPercap
0  Afghanistan      Asia  1952   28.801   8425333  779.445314
1  Afghanistan      Asia  1957   30.332   9240934  820.853030
2  Afghanistan      Asia  1962   31.997  10267083  853.100710
3  Afghanistan      Asia  1967   34.020  11537966  836.197138
4  Afghanistan      Asia  1972   36.088  13079460  739.981106

In [83]:
df.groupby('continent').mean()   #대륙별 로 묶였을때 연도평균이 의미가 있나?
#여기서는 year이 의미가 없음 
df.groupby(['continent','year']).mean()    #각 해의 평균기대수명을 보임 #여러개를 한번에 그룹바이

                  lifeExp           pop     gdpPercap
continent year
Africa    1952  39.135500  4.570010e+06   1252.572466
          1957  41.266346  5.093033e+06   1385.236062
          1962  43.319442  5.702247e+06   1598.078825
          1967  45.334538  6.447875e+06   2050.363801
          1972  47.450942  7.305376e+06   2339.615674
          1977  49.580423  8.328097e+06   2585.938508
          1982  51.592865  9.602857e+06   2481.592960
          1987  53.344788  1.105450e+07   2282.668991
          1992  53.629577  1.267464e+07   2281.810333
          1997  53.598269  1.430448e+07   2378.759555
          2002  53.325231  1.603315e+07   2599.385159
          2007  54.806038  1.787576e+07   3089.032605
Americas  1952  53.279840  1.380610e+07   4079.062552
          1957  55.960280  1.547816e+07   4616.043733
          1962  58.398760  1.733081e+07   4901.541870
          1967  60.410920  1.922986e+07   5668.253496
          1972  62.394920  2.117537e+07   6491.334139
          1977  64.391560  2.312271e+07   7352.007126
          1982  66.228840  2.521164e+07   7506.737088
          1987  68.090720  2.731016e+07   7793.400261
          1992  69.568360  2.957096e+07   8044.934406
          1997  71.150480  3.187602e+07   8889.300863
          2002  72.422040  3.399091e+07   9287.677107
          2007  73.608120  3.595485e+07  11003.031625
Asia      1952  46.314394  4.228356e+07   5195.484004
          1957  49.318544  4.735699e+07   5787.732940
          1962  51.563223  5.140476e+07   5729.369625
          1967  54.663640  5.774736e+07   5971.173374
          1972  57.319269  6.518098e+07   8187.468699
          1977  59.610556  7.225799e+07   7791.314020
          1982  62.617939  7.909502e+07   7434.135157
          1987  64.851182  8.700669e+07   7608.226508
          1992  66.537212  9.494825e+07   8639.690248
          1997  68.020515  1.025238e+08   9834.093295
          2002  69.233879  1.091455e+08  10174.090397
          2007  70.728485  1.155138e+08  12473.026870
Europe    1952  64.408500  1.393736e+07   5661.057435
          1957  66.703067  1.459635e+07   6963.012816
          1962  68.539233  1.534517e+07   8365.486814
          1967  69.737600  1.603930e+07  10143.823757
          1972  70.775033  1.668784e+07  12479.575246
          1977  71.937767  1.723882e+07  14283.979110
          1982  72.806400  1.770890e+07  15617.896551
          1987  73.642167  1.810314e+07  17214.310727
          1992  74.440100  1.860476e+07  17061.568084
          1997  75.505167  1.896480e+07  19076.781802
          2002  76.700600  1.927413e+07  21711.732422
          2007  77.648600  1.953662e+07  25054.481636
Oceania   1952  69.255000  5.343003e+06  10298.085650
          1957  70.295000  5.970988e+06  11598.522455
          1962  71.085000  6.641759e+06  12696.452430
          1967  71.310000  7.300207e+06  14495.021790
          1972  71.910000  8.053050e+06  16417.333380
          1977  72.855000  8.619500e+06  17283.957605
          1982  74.290000  9.197425e+06  18554.709840
          1987  75.320000  9.787208e+06  20448.040160
          1992  76.945000  1.045983e+07  20894.045885
          1997  78.190000  1.112072e+07  24024.175170
          2002  79.740000  1.172741e+07  26938.778040
          2007  80.719500  1.227497e+07  29810.188275

In [85]:
df.groupby(['continent','year']).mean()['lifeExp']

continent  year
Africa     1952    39.135500
           1957    41.266346
           1962    43.319442
           1967    45.334538
           1972    47.450942
           1977    49.580423
           1982    51.592865
           1987    53.344788
           1992    53.629577
           1997    53.598269
           2002    53.325231
           2007    54.806038
Americas   1952    53.279840
           1957    55.960280
           1962    58.398760
           1967    60.410920
           1972    62.394920
           1977    64.391560
           1982    66.228840
           1987    68.090720
           1992    69.568360
           1997    71.150480
           2002    72.422040
           2007    73.608120
Asia       1952    46.314394
           1957    49.318544
           1962    51.563223
           1967    54.663640
           1972    57.319269
           1977    59.610556
           1982    62.617939
           1987    64.851182
           1992    66.537212
           1997    68.020515
           2002    69.233879
           2007    70.728485
Europe     1952    64.408500
           1957    66.703067
           1962    68.539233
           1967    69.737600
           1972    70.775033
           1977    71.937767
           1982    72.806400
           1987    73.642167
           1992    74.440100
           1997    75.505167
           2002    76.700600
           2007    77.648600
Oceania    1952    69.255000
           1957    70.295000
           1962    71.085000
           1967    71.310000
           1972    71.910000
           1977    72.855000
           1982    74.290000
           1987    75.320000
           1992    76.945000
           1997    78.190000
           2002    79.740000
           2007    80.719500
Name: lifeExp, dtype: float64

In [86]:
df.groupby(['year','continent']).mean()    #첫번째기준으로 묶고 그다음 칼럼으로 묶어서 나타냄

                  lifeExp           pop     gdpPercap
year continent
1952 Africa     39.135500  4.570010e+06   1252.572466
     Americas   53.279840  1.380610e+07   4079.062552
     Asia       46.314394  4.228356e+07   5195.484004
     Europe     64.408500  1.393736e+07   5661.057435
     Oceania    69.255000  5.343003e+06  10298.085650
1957 Africa     41.266346  5.093033e+06   1385.236062
     Americas   55.960280  1.547816e+07   4616.043733
     Asia       49.318544  4.735699e+07   5787.732940
     Europe     66.703067  1.459635e+07   6963.012816
     Oceania    70.295000  5.970988e+06  11598.522455
1962 Africa     43.319442  5.702247e+06   1598.078825
     Americas   58.398760  1.733081e+07   4901.541870
     Asia       51.563223  5.140476e+07   5729.369625
     Europe     68.539233  1.534517e+07   8365.486814
     Oceania    71.085000  6.641759e+06  12696.452430
1967 Africa     45.334538  6.447875e+06   2050.363801
     Americas   60.410920  1.922986e+07   5668.253496
     Asia       54.663640  5.774736e+07   5971.173374
     Europe     69.737600  1.603930e+07  10143.823757
     Oceania    71.310000  7.300207e+06  14495.021790
1972 Africa     47.450942  7.305376e+06   2339.615674
     Americas   62.394920  2.117537e+07   6491.334139
     Asia       57.319269  6.518098e+07   8187.468699
     Europe     70.775033  1.668784e+07  12479.575246
     Oceania    71.910000  8.053050e+06  16417.333380
1977 Africa     49.580423  8.328097e+06   2585.938508
     Americas   64.391560  2.312271e+07   7352.007126
     Asia       59.610556  7.225799e+07   7791.314020
     Europe     71.937767  1.723882e+07  14283.979110
     Oceania    72.855000  8.619500e+06  17283.957605
1982 Africa     51.592865  9.602857e+06   2481.592960
     Americas   66.228840  2.521164e+07   7506.737088
     Asia       62.617939  7.909502e+07   7434.135157
     Europe     72.806400  1.770890e+07  15617.896551
     Oceania    74.290000  9.197425e+06  18554.709840
1987 Africa     53.344788  1.105450e+07   2282.668991
     Americas   68.090720  2.731016e+07   7793.400261
     Asia       64.851182  8.700669e+07   7608.226508
     Europe     73.642167  1.810314e+07  17214.310727
     Oceania    75.320000  9.787208e+06  20448.040160
1992 Africa     53.629577  1.267464e+07   2281.810333
     Americas   69.568360  2.957096e+07   8044.934406
     Asia       66.537212  9.494825e+07   8639.690248
     Europe     74.440100  1.860476e+07  17061.568084
     Oceania    76.945000  1.045983e+07  20894.045885
1997 Africa     53.598269  1.430448e+07   2378.759555
     Americas   71.150480  3.187602e+07   8889.300863
     Asia       68.020515  1.025238e+08   9834.093295
     Europe     75.505167  1.896480e+07  19076.781802
     Oceania    78.190000  1.112072e+07  24024.175170
2002 Africa     53.325231  1.603315e+07   2599.385159
     Americas   72.422040  3.399091e+07   9287.677107
     Asia       69.233879  1.091455e+08  10174.090397
     Europe     76.700600  1.927413e+07  21711.732422
     Oceania    79.740000  1.172741e+07  26938.778040
2007 Africa     54.806038  1.787576e+07   3089.032605
     Americas   73.608120  3.595485e+07  11003.031625
     Asia       70.728485  1.155138e+08  12473.026870
     Europe     77.648600  1.953662e+07  25054.481636
     Oceania    80.719500  1.227497e+07  29810.188275

In [87]:
df.groupby(['year','continent']).mean()['gdpPercap']

year  continent
1952  Africa        1252.572466
      Americas      4079.062552
      Asia          5195.484004
      Europe        5661.057435
      Oceania      10298.085650
1957  Africa        1385.236062
      Americas      4616.043733
      Asia          5787.732940
      Europe        6963.012816
      Oceania      11598.522455
1962  Africa        1598.078825
      Americas      4901.541870
      Asia          5729.369625
      Europe        8365.486814
      Oceania      12696.452430
1967  Africa        2050.363801
      Americas      5668.253496
      Asia          5971.173374
      Europe       10143.823757
      Oceania      14495.021790
1972  Africa        2339.615674
      Americas      6491.334139
      Asia          8187.468699
      Europe       12479.575246
      Oceania      16417.333380
1977  Africa        2585.938508
      Americas      7352.007126
      Asia          7791.314020
      Europe       14283.979110
      Oceania      17283.957605
1982  Africa        2481.592960
      Americas      7506.737088
      Asia          7434.135157
      Europe       15617.896551
      Oceania      18554.709840
1987  Africa        2282.668991
      Americas      7793.400261
      Asia          7608.226508
      Europe       17214.310727
      Oceania      20448.040160
1992  Africa        2281.810333
      Americas      8044.934406
      Asia          8639.690248
      Europe       17061.568084
      Oceania      20894.045885
1997  Africa        2378.759555
      Americas      8889.300863
      Asia          9834.093295
      Europe       19076.781802
      Oceania      24024.175170
2002  Africa        2599.385159
      Americas      9287.677107
      Asia         10174.090397
      Europe       21711.732422
      Oceania      26938.778040
2007  Africa        3089.032605
      Americas     11003.031625
      Asia         12473.026870
      Europe       25054.481636
      Oceania      29810.188275
Name: gdpPercap, dtype: float64

In [89]:
df.groupby('continent')['lifeExp'].count()

continent
Africa      624
Americas    300
Asia        396
Europe      360
Oceania      24
Name: lifeExp, dtype: int64

In [91]:
df.groupby('continent')['lifeExp'].size()

continent
Africa      624
Americas    300
Asia        396
Europe      360
Oceania      24
Name: lifeExp, dtype: int64

In [92]:
df.groupby('continent')['lifeExp'].nunique()

continent
Africa      619
Americas    299
Asia        393
Europe      326
Oceania      24
Name: lifeExp, dtype: int64

In [93]:
'''
index   key     value
0       a         1
1       a         1
2       b        None
3       b         1
4       a         2

이라는 데이터테이블이 있을떄 
#count
key
a       3           (1,1,2)
b       1           (1)

#size
key
a       3           (1,1,2)
b       2           (1,None)

#nunique
key
a       2           (1,2)
b       1           (1)

넌유니크 : 유니크한값이 몇개가 있나 ? a는 2개 b는 1개가있다 1,2, b는 1 none은 안침
사이즈 : 모든 값을 다 알려줌
카운트 : none이 아닌값을 알려줌 
'''

'\nindex   key     value\n0       a         1\n1       a         1\n2       b        None\n3       b         1\n4       a         2\n\n이라는 데이터테이블이 있을떄 \n#count\nkey\na       3           (1,1,2)\nb       1           (1)\n\n#size\nkey\na       3           (1,1,2)\nb       2           (1,None)\n\n#nunique\nkey\na       2           (1,2)\nb       1           (1)\n\n넌유니크 : 유니크한값이 몇개가 있나 ? a는 2개 b는 1개가있다 1,2, b는 1 none은 안침\n사이즈 : 모든 값을 다 알려줌\n카운트 : none이 아닌값을 알려줌 \n'

### 데이터 만들기

#### 시리즈 만들기

In [94]:
s = pd.Series(['banana',42])

In [95]:
s

0    banana
1        42
dtype: object

In [96]:
s=pd.Series(['Wes McKinney','Creator of Pandas'],index=['Person','Who'])  #값이 두개니 인덱스도 두개로 맞춰줬음

In [97]:
s

Person         Wes McKinney
Who       Creator of Pandas
dtype: object

In [98]:
dict={
    '이름':['원묵영','전혜선','체리'],
    '성별' : ['남','여','여']
    }

In [99]:
pd.DataFrame(dict)  #데이터프레임설정

    이름 성별
0  원묵영  남
1  전혜선  여
2   체리  여

In [102]:
df2=pd.DataFrame(dict,index=['강사','교육생','고양이']) 
df2

      이름 성별
강사   원묵영  남
교육생  전혜선  여
고양이   체리  여

In [104]:
df2=pd.DataFrame(dict,index=['강사','교육생','고양이'])
df2.loc['강사','이름']

'원묵영'

In [105]:
df2.iloc[0,0]

'원묵영'

In [106]:
df2.index

Index(['강사', '교육생', '고양이'], dtype='object')

In [107]:
df2.values

array([['원묵영', '남'],
       ['전혜선', '여'],
       ['체리', '여']], dtype=object)

In [108]:
df2.keys()   #칼럼들 잘 안씀

Index(['이름', '성별'], dtype='object')

In [109]:
df2.columns

Index(['이름', '성별'], dtype='object')

In [110]:
df2.index[0]  #천번째 인덱스가 궁금해

'강사'

In [111]:
df.head()

       country continent  year  lifeExp       pop   gdpPercap
0  Afghanistan      Asia  1952   28.801   8425333  779.445314
1  Afghanistan      Asia  1957   30.332   9240934  820.853030
2  Afghanistan      Asia  1962   31.997  10267083  853.100710
3  Afghanistan      Asia  1967   34.020  11537966  836.197138
4  Afghanistan      Asia  1972   36.088  13079460  739.981106

In [112]:
df.loc[df.index[3], df.columns[1]]

'Asia'

In [113]:
df.columns[1]

'continent'

In [114]:
df.index[3]

3

### 불린추출

In [115]:
scientists = pd.read_csv('data\scientists.csv')
scientists

                   Name        Born        Died  Age          Occupation
0     Rosaline Franklin  1920-07-25  1958-04-16   37             Chemist
1        William Gosset  1876-06-13  1937-10-16   61        Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90               Nurse
3           Marie Curie  1867-11-07  1934-07-04   66             Chemist
4         Rachel Carson  1907-05-27  1964-04-14   56           Biologist
5             John Snow  1813-03-15  1858-06-16   45           Physician
6           Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist
7          Johann Gauss  1777-04-30  1855-02-23   77       Mathematician

In [124]:
#펴ㅇ균나이 이상인사람만 뽑고싶다
mean_age=scientists['Age'].mean()
print(mean_age)
#방법1
[scientists['Age']>mean_age]# 대괄호로 묶어주고
scientists[scientists['Age']>mean_age]   #이렇게 해주면 []안의 조건에 맞는 사람들만 데이터프레임으로 만들어주겠다

59.125

                   Name        Born        Died  Age     Occupation
1        William Gosset  1876-06-13  1937-10-16   61   Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90          Nurse
3           Marie Curie  1867-11-07  1934-07-04   66        Chemist
7          Johann Gauss  1777-04-30  1855-02-23   77  Mathematician

In [125]:
#방법2
scientists[scientists['Age']>scientists["Age"].mean()]

                   Name        Born        Died  Age     Occupation
1        William Gosset  1876-06-13  1937-10-16   61   Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90          Nurse
3           Marie Curie  1867-11-07  1934-07-04   66        Chemist
7          Johann Gauss  1777-04-30  1855-02-23   77  Mathematician

In [126]:
scientists['Age'] +5   #브로드캐스팅 : 한번에 더해줌 (칼럼에다 더해주는거만으로 브로드캐스팅연산이됨)

0    42
1    66
2    95
3    71
4    61
5    50
6    46
7    82
Name: Age, dtype: int64

In [127]:
scientists.sort_index(ascending=False) #인덱스가 내림차순으로 정렬

                   Name        Born        Died  Age          Occupation
7          Johann Gauss  1777-04-30  1855-02-23   77       Mathematician
6           Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist
5             John Snow  1813-03-15  1858-06-16   45           Physician
4         Rachel Carson  1907-05-27  1964-04-14   56           Biologist
3           Marie Curie  1867-11-07  1934-07-04   66             Chemist
2  Florence Nightingale  1820-05-12  1910-08-13   90               Nurse
1        William Gosset  1876-06-13  1937-10-16   61        Statistician
0     Rosaline Franklin  1920-07-25  1958-04-16   37             Chemist

In [129]:
scientists.sort_values(by='Age',ascending=False)  #나이기준으로 정렬되는데 내림차순으로 정렬

                   Name        Born        Died  Age          Occupation
2  Florence Nightingale  1820-05-12  1910-08-13   90               Nurse
7          Johann Gauss  1777-04-30  1855-02-23   77       Mathematician
3           Marie Curie  1867-11-07  1934-07-04   66             Chemist
1        William Gosset  1876-06-13  1937-10-16   61        Statistician
4         Rachel Carson  1907-05-27  1964-04-14   56           Biologist
5             John Snow  1813-03-15  1858-06-16   45           Physician
6           Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist
0     Rosaline Franklin  1920-07-25  1958-04-16   37             Chemist

In [131]:
scientists.sort_values(by='Age')  #나이 오름차순으로 정렬

                   Name        Born        Died  Age          Occupation
0     Rosaline Franklin  1920-07-25  1958-04-16   37             Chemist
6           Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist
5             John Snow  1813-03-15  1858-06-16   45           Physician
4         Rachel Carson  1907-05-27  1964-04-14   56           Biologist
1        William Gosset  1876-06-13  1937-10-16   61        Statistician
3           Marie Curie  1867-11-07  1934-07-04   66             Chemist
7          Johann Gauss  1777-04-30  1855-02-23   77       Mathematician
2  Florence Nightingale  1820-05-12  1910-08-13   90               Nurse

### 연습문제

In [132]:
### 5x5의 랜덤한 매트릭스 생성
# 매트릭스의 전체함 전체평균 각 열의합 각행의 합 각열의 평균 각 행의 평균을 계산

In [133]:
import numpy as np

arr = np.random.randint(100,size=(5,5))
arr.sum()#전체 합
arr.mean() #전체평균
arr.sum(axis=0)# 열의합
arr.sum(axis=1) # 행의 함
arr.mean(axis=0) #각 열의평균
arr.mean(axis=1) #각 행의 평균

In [167]:
arr = np.random.randint(100,size=(5,5))  #렌덤만들기
arr

array([[ 4, 79,  5, 86, 78],
       [54,  4, 86, 18, 94],
       [85, 49, 53, 72,  4],
       [30, 70,  0, 86, 89],
       [ 5, 71, 86, 43, 87]])

In [168]:
arr.sum()#전체 합

1338

In [169]:
arr.mean() #전체평균

53.52

In [170]:
arr.sum(axis=0)# 열의합

array([178, 273, 230, 305, 352])

In [171]:
arr.sum(axis=1) # 행의 함

array([252, 256, 263, 275, 292])

In [172]:
arr.mean(axis=0) #각 열의평균

array([35.6, 54.6, 46. , 61. , 70.4])

In [173]:
arr.mean(axis=1) #각 행의 평균

array([50.4, 51.2, 52.6, 55. , 58.4])

In [174]:
### 아래와 같은 성적표 만들기
### 만들어진 성적표를 for문을 통해 성적만 차례대로 출력하기
#국어 70 영어 30 수학 80 과학 90 name : 성적표 drtpe int64

In [176]:
## any way
grade = {'국어':70,'영어':30,'수학':70,'과학':90}
grade_series=pd.Series(grade)

for i in grade_series:
    print(i)

70
30
70
90

In [177]:
dict={
    'name':['국어','영어','수학','과학'],
    'score' : [70,30,80,90]
    }

score=list(dict.values())[1]
for i in score:
    print(i)

70
30
80
90

In [147]:
dict

{'name': ['국어', '영어', '수학', '과학'], 'score': [70, 30, 80, 90]}

In [162]:
df_dict=pd.DataFrame(dict)
df_dict

  name  score
0   국어     70
1   영어     30
2   수학     80
3   과학     90

In [153]:
df_dict.iloc[:,1]

0    70
1    30
2    80
3    90
Name: score, dtype: int64

In [160]:
score=list(dict.values())[1]

In [161]:
for i in score:
    print(i)

70
30
80
90

In [163]:
mean_score=df_dict['score'].mean()
print(mean_score)
df_dict=pd.DataFrame(dict)
df_dict[df_dict['score']>80]
df_dict[df_dict['score']>mean_score]

67.5

In [164]:

df_dict[df_dict['score']>80]

  name  score
3   과학     90

In [165]:

df_dict[df_dict['score']>mean_score]

  name  score
0   국어     70
2   수학     80
3   과학     90

In [178]:
scientists.head()

                   Name        Born        Died  Age    Occupation
0     Rosaline Franklin  1920-07-25  1958-04-16   37       Chemist
1        William Gosset  1876-06-13  1937-10-16   61  Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90         Nurse
3           Marie Curie  1867-11-07  1934-07-04   66       Chemist
4         Rachel Carson  1907-05-27  1964-04-14   56     Biologist

In [179]:
scientists.sort_index(ascending=False)

                   Name        Born        Died  Age          Occupation
7          Johann Gauss  1777-04-30  1855-02-23   77       Mathematician
6           Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist
5             John Snow  1813-03-15  1858-06-16   45           Physician
4         Rachel Carson  1907-05-27  1964-04-14   56           Biologist
3           Marie Curie  1867-11-07  1934-07-04   66             Chemist
2  Florence Nightingale  1820-05-12  1910-08-13   90               Nurse
1        William Gosset  1876-06-13  1937-10-16   61        Statistician
0     Rosaline Franklin  1920-07-25  1958-04-16   37             Chemist

In [183]:
scientists.sort_values(by='Born')

                   Name        Born        Died  Age          Occupation
7          Johann Gauss  1777-04-30  1855-02-23   77       Mathematician
5             John Snow  1813-03-15  1858-06-16   45           Physician
2  Florence Nightingale  1820-05-12  1910-08-13   90               Nurse
3           Marie Curie  1867-11-07  1934-07-04   66             Chemist
1        William Gosset  1876-06-13  1937-10-16   61        Statistician
4         Rachel Carson  1907-05-27  1964-04-14   56           Biologist
6           Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist
0     Rosaline Franklin  1920-07-25  1958-04-16   37             Chemist

In [184]:
#2개칼럼이상을 기준으로 소트하게되면 첫번째 기준으로 정렬하고 동일값 있을시 두버째기준으로 소트함

scientists.sort_values(by=['Born','Died'])

                   Name        Born        Died  Age          Occupation
7          Johann Gauss  1777-04-30  1855-02-23   77       Mathematician
5             John Snow  1813-03-15  1858-06-16   45           Physician
2  Florence Nightingale  1820-05-12  1910-08-13   90               Nurse
3           Marie Curie  1867-11-07  1934-07-04   66             Chemist
1        William Gosset  1876-06-13  1937-10-16   61        Statistician
4         Rachel Carson  1907-05-27  1964-04-14   56           Biologist
6           Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist
0     Rosaline Franklin  1920-07-25  1958-04-16   37             Chemist

In [185]:
## Ex

asia_2007=df[(df['continent']=='Asia') & (df['year']==2007)]

In [186]:
head10=asia_2007.head(10)

In [187]:
head10['lifeExp']=head10['lifeExp'].apply(lambda x:int(x))

C:\Users\heysunn\AppData\Local\Temp\ipykernel_15460\2908066047.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  head10['lifeExp']=head10['lifeExp'].apply(lambda x:int(x))